docs/benchmark/results-wrk2-c1000/raw/gateway-R80000-r1.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.445ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.443ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.437ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.436ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47ms  725.09us  10.37ms   72.12%
    Req/Sec    21.08k     2.15k   29.22k    71.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.88ms
 90.000%    2.30ms
 99.000%    3.55ms
 99.900%    6.66ms
 99.990%    9.20ms
 99.999%   10.34ms
100.000%   10.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.044     0.000000            1         1.00
       0.621     0.100000        30037         1.11
       0.849     0.200000        60049         1.25
       1.052     0.300000        90095         1.43
       1.233     0.400000       120035         1.67
       1.404     0.500000       150062         2.00
       1.492     0.550000       165131         2.22
       1.583     0.600000       180201         2.50
       1.675     0.650000       195158         2.86
       1.773     0.700000       210106         3.33
       1.878     0.750000       225049         4.00
       1.936     0.775000       232584         4.44
       1.997     0.800000       240106         5.00
       2.061     0.825000       247565         5.71
       2.131     0.850000       255242         6.67
       2.207     0.875000       262615         8.00
       2.251     0.887500       266422         8.89
       2.299     0.900000       270165        10.00
       2.353     0.912500       273878        11.43
       2.415     0.925000       277559        13.33
       2.497     0.937500       281367        16.00
       2.549     0.943750       283197        17.78
       2.611     0.950000       285091        20.00
       2.683     0.956250       286976        22.86
       2.765     0.962500       288809        26.67
       2.863     0.968750       290695        32.00
       2.921     0.971875       291648        35.56
       2.985     0.975000       292575        40.00
       3.061     0.978125       293517        45.71
       3.139     0.981250       294452        53.33
       3.235     0.984375       295380        64.00
       3.297     0.985938       295850        71.11
       3.373     0.987500       296326        80.00
       3.469     0.989062       296789        91.43
       3.609     0.990625       297250       106.67
       3.787     0.992188       297719       128.00
       3.877     0.992969       297952       142.22
       3.991     0.993750       298186       160.00
       4.115     0.994531       298425       182.86
       4.271     0.995313       298656       213.33
       4.519     0.996094       298889       256.00
       4.703     0.996484       299008       284.44
       4.927     0.996875       299124       320.00
       5.183     0.997266       299244       365.71
       5.543     0.997656       299358       426.67
       5.863     0.998047       299475       512.00
       6.015     0.998242       299538       568.89
       6.179     0.998437       299593       640.00
       6.339     0.998633       299651       731.43
       6.495     0.998828       299710       853.33
       6.683     0.999023       299769      1024.00
       6.799     0.999121       299798      1137.78
       6.919     0.999219       299827      1280.00
       7.011     0.999316       299856      1462.86
       7.155     0.999414       299887      1706.67
       7.299     0.999512       299915      2048.00
       7.383     0.999561       299930      2275.56
       7.447     0.999609       299944      2560.00
       7.875     0.999658       299959      2925.71
       8.111     0.999707       299974      3413.33
       8.447     0.999756       299988      4096.00
       8.687     0.999780       299996      4551.11
       8.751     0.999805       300004      5120.00
       8.823     0.999829       300010      5851.43
       8.991     0.999854       300018      6826.67
       9.079     0.999878       300025      8192.00
       9.175     0.999890       300029      9102.22
       9.223     0.999902       300032     10240.00
       9.319     0.999915       300036     11702.86
       9.519     0.999927       300040     13653.33
       9.647     0.999939       300043     16384.00
       9.815     0.999945       300045     18204.44
       9.983     0.999951       300047     20480.00
      10.047     0.999957       300049     23405.71
      10.079     0.999963       300051     27306.67
      10.167     0.999969       300054     32768.00
      10.167     0.999973       300054     36408.89
      10.167     0.999976       300054     40960.00
      10.271     0.999979       300055     46811.43
      10.327     0.999982       300057     54613.33
      10.327     0.999985       300057     65536.00
      10.327     0.999986       300057     72817.78
      10.343     0.999988       300059     81920.00
      10.343     0.999989       300059     93622.86
      10.343     0.999991       300059    109226.67
      10.343     0.999992       300059    131072.00
      10.343     0.999993       300059    145635.56
      10.359     0.999994       300060    163840.00
      10.359     0.999995       300060    187245.71
      10.359     0.999995       300060    218453.33
      10.359     0.999996       300060    262144.00
      10.359     0.999997       300060    291271.11
      10.375     0.999997       300061    327680.00
      10.375     1.000000       300061          inf
#[Mean    =        1.466, StdDeviation   =        0.725]
#[Max     =       10.368, Total count    =       300061]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1150624 requests in 15.00s, 735.20MB read
Requests/sec:  76702.28
Transfer/sec:     49.01MB