docs/benchmark/results-wrk2-c1000/raw/gateway-R80000-r2.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.391ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.397ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.395ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms  675.26us  11.40ms   69.67%
    Req/Sec    21.09k     1.96k   29.50k    70.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.80ms
 90.000%    2.21ms
 99.000%    3.30ms
 99.900%    5.19ms
 99.990%    8.53ms
 99.999%   11.31ms
100.000%   11.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.062     0.000000            1         1.00
       0.589     0.100000        30074         1.11
       0.795     0.200000        59995         1.25
       0.984     0.300000        90010         1.43
       1.163     0.400000       120018         1.67
       1.331     0.500000       150011         2.00
       1.416     0.550000       164961         2.22
       1.507     0.600000       179976         2.50
       1.600     0.650000       194931         2.86
       1.697     0.700000       209990         3.33
       1.800     0.750000       224993         4.00
       1.855     0.775000       232444         4.44
       1.914     0.800000       239959         5.00
       1.979     0.825000       247402         5.71
       2.049     0.850000       254953         6.67
       2.125     0.875000       262419         8.00
       2.167     0.887500       266321         8.89
       2.211     0.900000       269962        10.00
       2.265     0.912500       273750        11.43
       2.325     0.925000       277401        13.33
       2.399     0.937500       281168        16.00
       2.443     0.943750       283024        17.78
       2.499     0.950000       284922        20.00
       2.567     0.956250       286807        22.86
       2.645     0.962500       288646        26.67
       2.739     0.968750       290512        32.00
       2.795     0.971875       291461        35.56
       2.855     0.975000       292385        40.00
       2.923     0.978125       293341        45.71
       2.993     0.981250       294261        53.33
       3.085     0.984375       295203        64.00
       3.137     0.985938       295668        71.11
       3.193     0.987500       296131        80.00
       3.255     0.989062       296612        91.43
       3.325     0.990625       297068       106.67
       3.409     0.992188       297539       128.00
       3.467     0.992969       297773       142.22
       3.543     0.993750       298005       160.00
       3.647     0.994531       298241       182.86
       3.763     0.995313       298474       213.33
       3.895     0.996094       298712       256.00
       3.979     0.996484       298825       284.44
       4.075     0.996875       298943       320.00
       4.167     0.997266       299062       365.71
       4.287     0.997656       299179       426.67
       4.435     0.998047       299294       512.00
       4.543     0.998242       299352       568.89
       4.647     0.998437       299411       640.00
       4.799     0.998633       299470       731.43
       5.003     0.998828       299529       853.33
       5.231     0.999023       299587      1024.00
       5.399     0.999121       299617      1137.78
       5.607     0.999219       299646      1280.00
       6.007     0.999316       299675      1462.86
       6.271     0.999414       299704      1706.67
       6.571     0.999512       299733      2048.00
       6.651     0.999561       299748      2275.56
       6.779     0.999609       299762      2560.00
       6.919     0.999658       299777      2925.71
       7.151     0.999707       299792      3413.33
       7.227     0.999756       299806      4096.00
       7.407     0.999780       299814      4551.11
       7.643     0.999805       299822      5120.00
       7.723     0.999829       299828      5851.43
       7.963     0.999854       299836      6826.67
       8.187     0.999878       299843      8192.00
       8.359     0.999890       299847      9102.22
       8.615     0.999902       299850     10240.00
       8.799     0.999915       299854     11702.86
       8.887     0.999927       299858     13653.33
       9.095     0.999939       299861     16384.00
       9.191     0.999945       299863     18204.44
       9.247     0.999951       299865     20480.00
       9.311     0.999957       299867     23405.71
       9.431     0.999963       299869     27306.67
      10.423     0.999969       299870     32768.00
      10.455     0.999973       299871     36408.89
      10.567     0.999976       299872     40960.00
      10.815     0.999979       299873     46811.43
      10.975     0.999982       299874     54613.33
      11.191     0.999985       299875     65536.00
      11.191     0.999986       299875     72817.78
      11.311     0.999988       299876     81920.00
      11.311     0.999989       299876     93622.86
      11.335     0.999991       299877    109226.67
      11.335     0.999992       299877    131072.00
      11.335     0.999993       299877    145635.56
      11.351     0.999994       299878    163840.00
      11.351     0.999995       299878    187245.71
      11.351     0.999995       299878    218453.33
      11.351     0.999996       299878    262144.00
      11.351     0.999997       299878    291271.11
      11.407     0.999997       299879    327680.00
      11.407     1.000000       299879          inf
#[Mean    =        1.391, StdDeviation   =        0.675]
#[Max     =       11.400, Total count    =       299879]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1150467 requests in 15.00s, 735.10MB read
Requests/sec:  76698.82
Transfer/sec:     49.01MB